c5/src/Documents/PaymentOrder/PaymentOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PaymentOrder</name>
  <posting>Deny</posting>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Division</name>
    <type>
      <types>CatalogRef.Divisions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExcludeTaxes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTaxRate</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContent</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Recipient</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToCompany</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Trezorerial</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Unload</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Documents/PaymentOrder/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	LocalCurrency = Application.Currency ();
	Company = Logins.Settings ( "Company" ).Company;
	
EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )

	if ( EventName = Enum.MessageBankingAppUnloaded () ) then
		Items.List.Refresh ();
	endif;

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure BankAccountOnChange ( Item )
	
	filterByBankAccount ();
	
EndProcedure

&AtServer
Procedure filterByBankAccount ()

	DC.ChangeFilter ( List, "BankAccount", BankAccount, not BankAccount.IsEmpty () );

EndProcedure

&AtClient
Procedure RecipientOnChange ( Item )
	
	filterByRecipient ();
	
EndProcedure

&AtServer
Procedure filterByRecipient ()

	DC.ChangeFilter ( List, "Recipient", Recipient, not Recipient.IsEmpty () );

EndProcedure
